// refer https://zh.wikipedia.org/wiki/Wikipedia:%E5%8E%86%E5%8F%B2%E4%B8%8A%E7%9A%84%E4%BB%8A%E5%A4%A9
var events = {
  '0601': [
    '1938年：第一本超人漫畫出版。',
    '1980年：美國電視新聞頻道CNN在亞特蘭大正式開播，為首個全天24小時播放的電視聯播網。',
    '2003年：世界最大的水利樞紐工程，位於中國長江上的三峽工程正式下閘蓄水。'
  ],
  '0602': [
    '1896年：義大利發明家古列爾莫·馬可尼在英國獲得他發明的無線電技術的專利。',
    '1946年：義大利舉行決定國家政體的公民投票，義大利王國被廢除，義大利共和國成立。',
  ],
  '0603': [
    '1839年：中國清朝欽差大臣林則徐下令在虎門集中銷毀237萬斤的鴉片，為第一次鴉片戰爭導火線。',
    '1919年：中國出現第一次大規模罷工：上海發起，紡織、機器、鐵路、汽車、輪船、鐵廠等50多個企業約7萬工人罷工。',
    '1959年：新加坡頒布新憲法：結束其英國直轄殖民地的地位。',
  ],
  '0604': [
    '1989年：六四事件：中國政府出動軍隊鎮壓天安門廣場內的示威民眾。',
    '1999年：中華民國立法院三讀通過「菸酒管理法」，開放民間可以公開方式參與菸酒產銷，宣告台灣實施近五十年的菸酒專賣制度將走入歷史。'
  ],
  '0605': [
    '1851年：湯姆叔叔的小屋在美國報紙《國家時代》上開始連載。',
    '1977年：美國蘋果公司研發的Apple II微型計算機正式上市。',
  ],
  '0607': [
    '1494年：西班牙和葡萄牙達成瓜分歐洲以外新發現陸地的《托爾德西里亞斯條約》。',
    '2008年：張韶涵受邀參與北京奧運會火炬傳遞，成為第一位台灣籍藝人火炬手。',
  ],
  '0608': [
    '1912年：袁世凱公布參議院議決中華民國國旗為五色旗，十九星旗為陸軍旗，青天白日紅旗為海軍旗，商旗適用國旗。',
    '1949年：英國作家喬治·歐威爾創作的政治小說《一九八四》首次出版。',
    '1995年：程式設計師拉斯姆斯·勒多夫發布腳本語言PHP第一個版本。',
  ],
  '0609': [
    '1898年：清朝總理各國事務衙門大臣李鴻章和英國駐華公使竇納樂在北京簽訂《展拓香港界址專條》，將新界租借給英國，期限99年。',
    '1934年：唐老鴨在美國華特迪士尼公司製作的動畫片《聰明的小母雞》中首次亮相。',
  ],
  '0610': [
    '1943年：在阿根廷避難的匈牙利兄弟拉季斯洛·比羅和喬治·比羅申請了原子筆專利。',
  ],
  '0611': [
    '1982年：美國導演史蒂芬·史匹柏執導的科幻電影《E.T.外星人》首映。',
    '2017年：西班牙選手拉斐爾·納達爾獲得2017年法國網球公開賽男子單打比賽的冠軍，成為史上第一位能在單一大滿貫拿下十座冠軍的網球選手。'
  ],
  '0612': [
    '1942年：在被德國占領下的荷蘭阿姆斯特丹生活的猶太人女孩安妮·弗蘭克開始寫她的日記。',
    '1989年：美國華裔網球好手張德培擊敗瑞典的斯特凡·埃德伯格奪得法國網球公開賽男子單打冠軍，是歷來第一個華人贏得網球大滿貫其中一項錦標。',
  ],
  '0613': [
    '1956年：皇家馬德里以四比三擊敗法國的蘭斯奪得首屆歐洲冠軍球會盃冠軍。',
    '2010年：日本宇宙空間研究所（現宇宙航空研究開發機構）發射的小行星探測器隼鳥號回歸地球，結束七年旅程，同時成為史上第一架前往小行星探測後回到地球的宇宙探測器。',
  ],
  '0614': [
    '1777年：美國第二屆大陸會議採用星條旗作為獨立後的美國國旗。',
    '1985年：西德、法國、荷蘭、比利時、盧森堡五國在盧森堡小鎮申根簽署取消相互之間邊境檢查的《申根協定》。',
  ],
  '0615': [
    '1949年：中華民國臺灣省政府公布《新臺幣發行辦法》，新台幣正式發行。',
    '2012年：美國航空航天局宣布，1977年發射的旅行者1號已抵達太陽系的邊緣，將成為首個脫離太陽系的人造物體。',
  ],
  '0616': [
  ],
  '0617': [
  ],
  '0618': [
  ],
  '0619': [
  ],
  '0620': [
  ],
  '0621': [
  ],
  '0622': [
  ],
  '0623': [
  ],
  '0624': [
  ],
  '0625': [
  ],
  '0626': [
  ],
  '0627': [
  ],
  '0628': [
  ],
  '0629': [
  ],
  '0630': [
  ],
}
